In [1]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.1)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.5)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.4)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [11]:
df=pd.read_csv("holiday_schedules.csv")

In [12]:
df.head()

,id,location_id,service_id,start_date,end_date,closed,opens_at,closes_at
0,1,22.0,NaN,"January 01, 0001","January 01, 0001",True,NaN,NaN
1,2,22.0,NaN,12/24/2015,12/24/15,False,10:00,16:00
2,3,22.0,NaN,"June 01, 0001","September 01, 0001",True,NaN,NaN
3,4,NaN,22.0,"January 01, 0001","January 01, 0001",True,NaN,NaN

In [13]:
df.head(3)

,id,location_id,service_id,start_date,end_date,closed,opens_at,closes_at
0,1,22.0,NaN,"January 01, 0001","January 01, 0001",True,NaN,NaN
1,2,22.0,NaN,12/24/2015,12/24/15,False,10:00,16:00
2,3,22.0,NaN,"June 01, 0001","September 01, 0001",True,NaN,NaN

In [14]:
df.tail()

,id,location_id,service_id,start_date,end_date,closed,opens_at,closes_at
0,1,22.0,NaN,"January 01, 0001","January 01, 0001",True,NaN,NaN
1,2,22.0,NaN,12/24/2015,12/24/15,False,10:00,16:00
2,3,22.0,NaN,"June 01, 0001","September 01, 0001",True,NaN,NaN
3,4,NaN,22.0,"January 01, 0001","January 01, 0001",True,NaN,NaN

In [15]:
type(df)

pandas.core.frame.DataFrame

In [16]:
df.columns

Index(['id', 'location_id', 'service_id', 'start_date', 'end_date', 'closed',
       'opens_at', 'closes_at'],
      dtype='object')

In [17]:
df['location_id']

0    22.0
1    22.0
2    22.0
3     NaN
Name: location_id, dtype: float64

In [18]:
df['service_id']

0     NaN
1     NaN
2     NaN
3    22.0
Name: service_id, dtype: float64

In [19]:
list(df.columns)

['id',
 'location_id',
 'service_id',
 'start_date',
 'end_date',
 'closed',
 'opens_at',
 'closes_at']

In [21]:
type(df['service_id'])

pandas.core.series.Series

In [22]:
list(df['service_id'])

[nan, nan, nan, 22.0]

In [23]:
[df['service_id']]

[0     NaN
 1     NaN
 2     NaN
 3    22.0
 Name: service_id, dtype: float64]

In [25]:
type(df['service_id'])

pandas.core.series.Series

In [26]:
data=pd.read_csv("addresses.csv")

In [27]:
data.head()

,id,location_id,address_1,address_2,city,state_province,postal_code,country
0,1,1,2600 Middlefield Road,NaN,Redwood City,CA,94063,US
1,2,2,24 Second Avenue,NaN,San Mateo,CA,94401,US
2,3,3,24 Second Avenue,NaN,San Mateo,CA,94403,US
3,4,4,24 Second Avenue,NaN,San Mateo,CA,94401,US
4,5,5,24 Second Avenue,NaN,San Mateo,CA,94401,US

In [29]:
data[['city','country']]

                   city country
0          Redwood City      US
1             San Mateo      US
2             San Mateo      US
3             San Mateo      US
4             San Mateo      US
5            Menlo Park      US
6            Menlo Park      US
7            Menlo Park      US
8          Redwood City      US
9          Redwood City      US
10         Redwood City      US
11         Redwood City      US
12         Redwood City      US
13         Redwood City      US
14        San Francisco      US
15            Sunnyvale      US
16  South San Francisco      US
17         Redwood City      US
18            San Mateo      US
19              Belmont      US
20        San Francisco      US

In [31]:
data.dtypes

id                 int64
location_id        int64
address_1         object
address_2         object
city              object
state_province    object
postal_code       object
country           object
dtype: object

In [32]:
df1=pd.read_excel("output.xlsx")

In [34]:
df1.head()

                                           Text Data
0  Famous & Authentic Veg & Vegan Food Brands fro...
1          Delivering safely across 19000+ pin codes
2  Our Buyer Protection covers your purchase from...
3  Quick Customer Service for a smooth shopping e...
4  This pale yellow-coloured flaky dessert is ser...

In [35]:
df1.columns

Index(['Text Data'], dtype='object')

In [3]:
table=pd.read_html("https://www.iplt20.com/points-table/")

In [37]:
pip install lxml

Collecting lxml
  Downloading lxml-4.9.3-cp310-cp310-manylinux_2_28_x86_64.whl (7.9 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 7.9/7.9 MB 59.7 MB/s eta 0:00:0000:0100:01
Installing collected packages: lxml
Successfully installed lxml-4.9.3
Note: you may need to restart the kernel to use updated packages.

In [9]:
len(table)

1

In [10]:
df3=table[0]

In [11]:
df3

,0,1,2,3,4
0,Role,Batsman,Nationality,Indian,NaN
1,Bats,NaN,Bowls,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN
3,Bio,NaN,NaN,NaN,NaN
4,A 22-year old opening batsman who hails from P...,A 22-year old opening batsman who hails from P...,A 22-year old opening batsman who hails from P...,A 22-year old opening batsman who hails from P...,NaN

In [12]:
df3.columns

Int64Index([0, 1, 2, 3, 4], dtype='int64')

In [13]:
df3.head()

,0,1,2,3,4
0,Role,Batsman,Nationality,Indian,NaN
1,Bats,NaN,Bowls,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN
3,Bio,NaN,NaN,NaN,NaN
4,A 22-year old opening batsman who hails from P...,A 22-year old opening batsman who hails from P...,A 22-year old opening batsman who hails from P...,A 22-year old opening batsman who hails from P...,NaN

In [15]:
df3.to_csv("data.csv",index=False)